#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Torch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Melee_Edged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Melee_Torch.B_Melee_Torch_C
// 0x0028 (0x0AA8 - 0x0A80)
class AB_Melee_Torch_C final : public AB_Melee_Edged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Melee_Torch_C;                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Torch_Fire_Start_Cue;                              // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Torch_Fire_Loop_Cue;                               // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Melee_Torch(int32 EntryPoint);
	void OnWeaponVisibilityChanged(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Melee_Torch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Melee_Torch_C")
	}
	static class AB_Melee_Torch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Melee_Torch_C>();
	}
};
DUMPER7_ASSERTS_AB_Melee_Torch_C;

}

