#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_SpookyMist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_SpookyMist.DA_SpookyMist_C
// 0x0040 (0x0A08 - 0x09C8)
class ADA_SpookyMist_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanCancelAbility;                                  // 0x09D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0x7];                                      // 0x09D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CanCancelTimer;                                    // 0x09D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CancelDelay;                                       // 0x09E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_SpookyMist(int32 EntryPoint);
	void BPOnUnEquip();
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void BPReleaseSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void CanCancel();
	void On_DBNO();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DA_SpookyMist_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_SpookyMist_C")
	}
	static class ADA_SpookyMist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_SpookyMist_C>();
	}
};
DUMPER7_ASSERTS_ADA_SpookyMist_C;

}

