#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrumShotGun_SK_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DrumShotGun_SK_AnimBP.DrumShotGun_SK_AnimBP_C
// 0x00A0 (0x0308 - 0x0268)
class UDrumShotGun_SK_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B86D730145535107B7503BB7858A1B67; // 0x0278(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3D25A14C4C8B1F4F18C10B9F2C9A4EF4; // 0x02A8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6E9E0BCA419CD4F42433C282CC789184; // 0x02C0(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_DrumShotGun_SK_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DrumShotGun_SK_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrumShotGun_SK_AnimBP_C")
	}
	static class UDrumShotGun_SK_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrumShotGun_SK_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UDrumShotGun_SK_AnimBP_C;

}

