#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_UtilityGrenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C
// 0x0028 (0x0C90 - 0x0C68)
class UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C final : public UGA_Athena_UtilityGrenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C; // 0x0C68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortContextTrapItemDefinition*         TrapDefinition;                                    // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             ProjectileTrajectoryRed;                           // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorRedClass;                       // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvalidTrapLocation;                               // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout(int32 EntryPoint);
	void InitTrajectoryVariables();
	void Server_SpawnProjectile(const struct FVector& Location, const struct FRotator& Direction);
	void CleanupTrajectoryDisplay();
	void UpdateTrajectorySpline();
	void K2_OnEndAbility(bool bWasCancelled);
	void InitializeDecoHelper();
	void EndTrapPreview();
	void SetUpDummyProjectileRed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C")
	}
	static class UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C;

}

