#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_TriggeredAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "QuestObjectiveData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Quest_TriggeredAbility.GA_Quest_TriggeredAbility_C
// 0x0030 (0x0970 - 0x0940)
class UGA_Quest_TriggeredAbility_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        OwningPlayerPawn;                                  // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQuestObjectiveData>            QuestsToCheck;                                     // 0x0950(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          HasCheckedQuests;                                  // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsQuestOwner;                                      // 0x0961(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsQuestAssister;                                   // 0x0962(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldUpdateQuests;                                // 0x0963(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_964[0x4];                                      // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      OwningPlayerQuestManager;                          // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Quest_TriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void CheckForQuestsAndAssists(bool* IsOwnerOrAssister);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Quest_TriggeredAbility_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Quest_TriggeredAbility_C")
	}
	static class UGA_Quest_TriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Quest_TriggeredAbility_C>();
	}
};
DUMPER7_ASSERTS_UGA_Quest_TriggeredAbility_C;

}

