#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_Search_ChestAmmo_AfterJumping

#include "Basic.hpp"

#include "GA_Quest_TriggeredAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Quest_Search_ChestAmmo_AfterJumping.GA_Quest_Search_ChestAmmo_AfterJumping_C
// 0x0028 (0x0998 - 0x0970)
class UGA_Quest_Search_ChestAmmo_AfterJumping_C final : public UGA_Quest_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Quest_Search_ChestAmmo_AfterJumping_C; // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_AfterLanding;                                    // 0x0978(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Chest;                                           // 0x0980(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_AmmoBox;                                         // 0x0988(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ChestCount;                                        // 0x0990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoBoxCount;                                      // 0x0994(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Quest_Search_ChestAmmo_AfterJumping(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Quest_Search_ChestAmmo_AfterJumping_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Quest_Search_ChestAmmo_AfterJumping_C")
	}
	static class UGA_Quest_Search_ChestAmmo_AfterJumping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Quest_Search_ChestAmmo_AfterJumping_C>();
	}
};
DUMPER7_ASSERTS_UGA_Quest_Search_ChestAmmo_AfterJumping_C;

}

