#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_Damage_AfterLaunchpad

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Quest_Damage_AfterLaunchpad.GA_Quest_Damage_AfterLaunchpad_C.ExecuteUbergraph_GA_Quest_Damage_AfterLaunchpad
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Quest_Damage_AfterLaunchpad_C_ExecuteUbergraph_GA_Quest_Damage_AfterLaunchpad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Quest_Damage_AfterLaunchpad_C_ExecuteUbergraph_GA_Quest_Damage_AfterLaunchpad;

// Function GA_Quest_Damage_AfterLaunchpad.GA_Quest_Damage_AfterLaunchpad_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Quest_Damage_AfterLaunchpad_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Quest_Damage_AfterLaunchpad_C_K2_ActivateAbilityFromEvent;

}

